GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
/*
 * Copyright (c) 2020-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wb_gpio.h"
#include "stm32wb_system.h"
#include "stm32wb_lptim.h"
#include "stm32wb_hsem.h"
#include "stm32wb_usbd.h"
#include "stm32wb_usbd_dcd.h"

#define STM32WB_USBD_DCD_STATE_NONE                       0
#define STM32WB_USBD_DCD_STATE_INIT                       1
#define STM32WB_USBD_DCD_STATE_NOT_READY                  2
#define STM32WB_USBD_DCD_STATE_READY                      3
#define STM32WB_USBD_DCD_STATE_RESET                      4
#define STM32WB_USBD_DCD_STATE_CONNECTED                  5
#define STM32WB_USBD_DCD_STATE_SLEEP                      6
#define STM32WB_USBD_DCD_STATE_SUSPENDED                  7

#define STM32WB_USBD_DCD_EP_COUNT                         8

#define STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK             0x0003
#define STM32WB_USBD_DCD_EP_CONTROL_TYPE_SHIFT            0
#define STM32WB_USBD_DCD_EP_CONTROL_TYPE_CONTROL          0x0000
#define STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO              0x0001
#define STM32WB_USBD_DCD_EP_CONTROL_TYPE_BULK             0x0002
#define STM32WB_USBD_DCD_EP_CONTROL_TYPE_INTERRUPT        0x0003
#define STM32WB_USBD_DCD_EP_CONTROL_TYPE_DBL              0x0004
#define STM32WB_USBD_DCD_EP_CONTROL_STALLED               0x0008
#define STM32WB_USBD_DCD_EP_CONTROL_ENABLED               0x0010
#define STM32WB_USBD_DCD_EP_CONTROL_STARTED               0x0020
#define STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED            0x0040
#define STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS_MASK      0xff80
#define STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS_SHIFT     6

#define STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(_control) (((_control) & STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS_MASK) >> STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS_SHIFT)

typedef struct _stm32wb_usbd_dcd_ep_in_t {
    uint16_t                                   control;
    uint16_t                                   size;
    union {
	struct {
	    stm32wb_usbd_dcd_ep_in_callback_t  callback;
	    void                               *context;
            const uint8_t                      *data;
	    uint16_t                           length;
            uint16_t                           count;
	} bulk;
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
	struct {
	    stm32wb_usbd_dcd_ep_iso_callback_t callback;
	    void                               *context;
            stm32wb_usbd_dcd_fifo_t            *fifo;
            uint16_t                           length[2];
	} iso;
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
    };
} stm32wb_usbd_dcd_ep_in_t;

typedef struct __stm32wb_usbd_dcd_ep_out_t {
    uint16_t                                   control;
    uint16_t                                   size;
    union {
	struct {
	    stm32wb_usbd_dcd_ep_out_callback_t callback;
	    void                               *context;
	    uint8_t                            *data;
	    uint16_t                           length;
	    uint16_t                           count;
	} bulk;
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
	struct {
	    stm32wb_usbd_dcd_ep_iso_callback_t callback;
	    void                               *context;
            stm32wb_usbd_dcd_fifo_t            *fifo;
	} iso;
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
    };
} stm32wb_usbd_dcd_ep_out_t;

#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
typedef void (*stm32wb_usbd_dcd_iso_in_routine_t)(uint32_t ep_index, stm32wb_usbd_dcd_ep_in_t *ep_in);
typedef void (*stm32wb_usbd_dcd_iso_out_routine_t)(uint32_t ep_index, stm32wb_usbd_dcd_ep_out_t *ep_out);
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */

typedef struct __stm32wb_usbd_dcd_device_t {
    volatile uint8_t                   state;
    volatile uint8_t                   clk48_on;
    volatile uint8_t                   clk48_sync;
    volatile uint8_t                   lpm_state;
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
    volatile uint32_t                  reference;
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
    uint16_t                           pma_btable;
    uint16_t                           pma_address;
    volatile uint32_t                  events;
    stm32wb_usbd_dcd_event_callback_t  evt_callback;
    void                               *evt_context;
#if (STM32WB_USBD_DCD_SOF_SUPPORTED == 1)
    stm32wb_usbd_dcd_sof_callback_t    sof_callback;
    void                               *sof_context;
#endif /* STM32WB_USBD_DCD_SOF_SUPPORTED == 1 */
    uint8_t                            *ep0_setup;
    uint8_t                            *ep0_data;
    uint8_t                            ep0_count;
    uint8_t                            ep0_length;
    stm32wb_usbd_dcd_ep_in_t           ep_in[STM32WB_USBD_DCD_EP_COUNT-1];  /* TX */
    stm32wb_usbd_dcd_ep_out_t          ep_out[STM32WB_USBD_DCD_EP_COUNT-1]; /* RX */
  //    uint8_t                            pma_index[STM32WB_USBD_DCD_EP_COUNT-1];
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
    stm32wb_usbd_dcd_iso_in_routine_t  iso_in_routine;
    stm32wb_usbd_dcd_iso_out_routine_t iso_out_routine;
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
    volatile uint8_t                   set_resume;
    volatile uint8_t                   unset_resume;
    stm32wb_lptim_timeout_t            timeout;
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
} stm32wb_usbd_dcd_device_t;

static stm32wb_usbd_dcd_device_t stm32wb_usbd_dcd_device;

