GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
static const uint16_t stm32wb_usbd_dcd_xlate_ep_type[4] = {
    USB_EP_CONTROL,
    USB_EP_ISOCHRONOUS,
    USB_EP_BULK,
    USB_EP_INTERRUPT,
};

#define USB_EP_BASE                                (USB1_BASE + 0x0000)
#define USB_PMA_BASE                               (USB1_BASE + 0x0400)
#define USB_PMA_SIZE                               0x0400

#define USB_BTABLE_SIZE                            (STM32WB_USBD_DCD_EP_COUNT * 8)

#define USB_EP0_SIZE                               STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE
#define USB_EP0_PMA_ADDRESS                        (USB_PMA_SIZE - STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE)

#define USB_EP_R(_ep_index)                        (*((volatile uint16_t*)(USB_EP_BASE + ((_ep_index) * 4))))
#define USB_EP_W(_ep_index, _data)                 (*((volatile uint16_t*)(USB_EP_BASE + ((_ep_index) * 4))) = (_data))

#define USB_LPMCSR_LPMEN                           USB_LPMCSR_LMPEN 

#define USB_EP_SWBUF_TX                            USB_EP_DTOG_RX
#define USB_EP_SWBUF_RX                            USB_EP_DTOG_TX

#define USB_EP_STAT_RX_MASK                        USB_EPRX_STAT                             
#define USB_EP_STAT_TX_MASK                        USB_EPTX_STAT                             
#define USB_EP_EA_MASK                             USB_EPADDR_FIELD
  
#define USBP_EP_RW_MASK                            (USB_EP_TYPE_MASK | USB_EP_KIND | USB_EP_EA_MASK)

#define USB_EP_CONFIG(_ep_index, _config)          USB_EP_W((_ep_index), (USB_EP_CTR_RX | USB_EP_CTR_TX | (_config)))
#define USB_EP_STAT_TX(_ep_index, _stat)           USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK | USB_EP_STAT_TX_MASK)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX | (_stat))))
#define USB_EP_CTR_TX_RESET(_ep_index)             USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK)) ^ (USB_EP_CTR_RX)))
#define USB_EP_DTOG_TX_RESET(_ep_index)            USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK | USB_EP_DTOG_TX)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX)))
#define USB_EP_STAT_RX(_ep_index, _stat)           USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK | USB_EP_STAT_RX_MASK)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX | (_stat))))
#define USB_EP_CTR_RX_RESET(_ep_index)             USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK)) ^ (USB_EP_CTR_TX)))
#define USB_EP_DTOG_RX_RESET(_ep_index)            USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK | USB_EP_DTOG_RX)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX)))
#define USB_EP_DTOG_TX_STATUS(_ep_index)           ((USB_EP_R((_ep_index)) & (USB_EP_DTOG_TX)) ? 1 : 0)
#define USB_EP_DTOG_RX_STATUS(_ep_index)           ((USB_EP_R((_ep_index)) & (USB_EP_DTOG_RX)) ? 1 : 0)

#if 0
#define USB_EP_KIND_SET(_ep_index)                 USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USB_EP_TYPE_MASK | USB_EP_EA_MASK)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX | USB_EP_KIND)))
#define USB_EP_KIND_RESET(_ep_index)               USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USB_EP_TYPE_MASK | USB_EP_EA_MASK)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX)))
#define USB_EP_DTOG_SWBUF_TX_RESET(_ep_index)      USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK | USB_EP_DTOG_TX | USB_EP_SWBUF_TX)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX)))
#define USB_EP_DTOG_SWBUF_RX_RESET(_ep_index)      USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK | USB_EP_DTOG_RX | USB_EP_SWBUF_RX)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX)))
#define USB_EP_SWBUF_TX_TOGGLE(_ep_index)          USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX | USB_EP_SWBUF_TX)))
#define USB_EP_SWBUF_RX_TOGGLE(_ep_index)          USB_EP_W((_ep_index), ((USB_EP_R((_ep_index)) & (USBP_EP_RW_MASK)) ^ (USB_EP_CTR_RX | USB_EP_CTR_TX | USB_EP_SWBUF_RX)))
#define USB_EP_SWBUF_TX_STATUS(_ep_index)          ((USB_EP_R((_ep_index)) & (USB_EP_SWBUF_TX)) ? 1 : 0)
#define USB_EP_SWBUF_RX_STATUS(_ep_index)          ((USB_EP_R((_ep_index)) & (USB_EP_SWBUF_RX)) ? 1 : 0)
#endif

#define USB_PMA_TX_ADDRESS(_pma_index, _address)    (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 0)) = (_address))
#define USB_PMA_TX_COUNT(_pma_index, _count)        (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 2)) = (_count))
#define USB_PMA_TX_0_ADDRESS(_pma_index, _address)  (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 0)) = (_address))
#define USB_PMA_TX_1_ADDRESS(_pma_index, _address)  (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 4)) = (_address))
#define USB_PMA_TX_0_COUNT(_pma_index, _count)      (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 2)) = (_count))
#define USB_PMA_TX_1_COUNT(_pma_index, _count)      (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 6)) = (_count))
#define USB_PMA_RX_ADDRESS(_pma_index, _address)    (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 4)) = (_address))
#define USB_PMA_RX_SIZE(_pma_index, _size)          (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 6)) = (_size))
#define USB_PMA_RX_COUNT(_pma_index)                (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 6)) & 0x03ff)
#define USB_PMA_RX_0_ADDRESS(_pma_index, _address)  (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 0)) = (_address))
#define USB_PMA_RX_1_ADDRESS(_pma_index, _address)  (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 4)) = (_address))
#define USB_PMA_RX_0_SIZE(_pma_index, _size)        (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 2)) = (_size))
#define USB_PMA_RX_1_SIZE(_pma_index, _size)        (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 6)) = (_size))
#define USB_PMA_RX_0_COUNT(_pma_index)              (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 2)) & 0x03ff)
#define USB_PMA_RX_1_COUNT(_pma_index)              (*((volatile uint16_t*)(USB_PMA_BASE + ((_pma_index) * 8) + 6)) & 0x03ff)

#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
static void stm32wb_usbd_dcd_wakeup_routine(void *context);
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */

static void __attribute__((optimize("O3"), noinline)) stm32wb_usbd_dcd_pma_write(uint32_t pma_address, const uint8_t *data, uint32_t count)
{
    volatile uint16_t *pma;
    const uint16_t *data16, *data16_e;

