GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
    pma = (volatile uint16_t*)(USB_PMA_BASE + pma_address);

    data16 = (const uint16_t*)(data);
    data16_e = (const uint16_t*)(data + (count & ~15));

    while (data16 != data16_e)
    {
	pma[0] = data16[0];
	pma[1] = data16[1];
	pma[2] = data16[2];
	pma[3] = data16[3];
	pma[4] = data16[4];
	pma[5] = data16[5];
	pma[6] = data16[6];
	pma[7] = data16[7];

	pma += 8;
	data16 += 8;
    }

    if (count & 15)
    {
	if (count & 8)
	{
	    pma[0] = data16[0];
	    pma[1] = data16[1];
	    pma[2] = data16[2];
	    pma[3] = data16[3];

	    pma += 4;
	    data16 += 4;
	}

    	if (count & 4)
	{
	    pma[0] = data16[0];
	    pma[1] = data16[1];

	    pma += 2;
	    data16 += 2;
	}

    	if (count & 2)
	{
	    pma[0] = data16[0];

	    pma += 1;
	    data16 += 1;
	}

	if (count & 1)
	{
	    data = (const uint8_t*)data16;
	    
	    pma[0] = data[0];
	}
    }
}

static void __attribute__((optimize("O3"), noinline)) stm32wb_usbd_dcd_pma_read(uint32_t pma_address, uint8_t *data, uint32_t count)
{
    volatile uint16_t *pma;
    uint16_t *data16, *data16_e;

    pma = (volatile uint16_t*)(USB_PMA_BASE + pma_address);
    
    data16 = (uint16_t*)(data);
    data16_e = (uint16_t*)(data + (count & ~15));

    while (data16 != data16_e)
    {
	data16[0] = pma[0];
	data16[1] = pma[1];
	data16[2] = pma[2];
	data16[3] = pma[3];
	data16[4] = pma[4];
	data16[5] = pma[5];
	data16[6] = pma[6];
	data16[7] = pma[7];

	pma += 8;
	data16 += 8;
    }

    if (count & 15)
    {
	if (count & 8)
	{
	    data16[0] = pma[0];
	    data16[1] = pma[1];
	    data16[2] = pma[2];
	    data16[3] = pma[3];

	    pma += 4;
	    data16 += 4;
	}

	if (count & 4)
	{
	    data16[0] = pma[0];
	    data16[1] = pma[1];

	    pma += 2;
	    data16 += 2;
	}

	if (count & 2)
	{
	    data16[0] = pma[0];

	    pma += 1;
	    data16 += 1;
	}

	if (count & 1)
	{
	    data = (uint8_t*)data16;

	    data[0] = pma[0];
	}
    }
}

bool stm32wb_usbd_dcd_configure(void)
{
    if (stm32wb_usbd_dcd_device.state != STM32WB_USBD_DCD_STATE_NONE)
    {
	return false;
    }

    stm32wb_usbd_dcd_device.pma_btable = 8;
    stm32wb_usbd_dcd_device.pma_address = USB_EP0_PMA_ADDRESS;

    NVIC_SetPriority(USB_HP_IRQn, STM32WB_USBD_DCD_IRQ_PRIORITY);
    NVIC_SetPriority(USB_LP_IRQn, STM32WB_USBD_DCD_IRQ_PRIORITY);
    NVIC_SetPriority(CRS_IRQn, STM32WB_USBD_DCD_IRQ_PRIORITY);
    
    stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_INIT;
    stm32wb_usbd_dcd_device.clk48_on = false;
    stm32wb_usbd_dcd_device.clk48_sync = false;

#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
    stm32wb_usbd_dcd_device.timeout = STM32WB_LPTIM_TIMEOUT_INIT();
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */
    
    return true;
}

bool stm32wb_usbd_dcd_enable(uint8_t *setup, stm32wb_usbd_dcd_event_callback_t callback, void *context)
{
    // armv7m_rtt_printf("DCD_ENABLE\n");

    if (stm32wb_usbd_dcd_device.state != STM32WB_USBD_DCD_STATE_INIT)
    {
	return false;
    }

    if (stm32wb_system_pclk1() < 10000000)
    {
	return false;
    }
    
    stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_NOT_READY;
    stm32wb_usbd_dcd_device.events = 0;

    stm32wb_usbd_dcd_device.evt_callback = callback;
    stm32wb_usbd_dcd_device.evt_context = context;
    stm32wb_usbd_dcd_device.ep0_setup = setup;

    stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PA11_USB_DM, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
    stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PA12_USB_DP, (STM32WB_GPIO_PARK_NONE | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));

    stm32wb_system_reference(STM32WB_SYSTEM_REFERENCE_USB);

    stm32wb_usbd_dcd_device.lpm_state = STM32WB_USBD_DCD_LPM_STATE_L3;
    
    stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_READY;
    
    return true;
}

bool stm32wb_usbd_dcd_disable(void)
{
    // armv7m_rtt_printf("DCD_DISABLE\n");

    if (stm32wb_usbd_dcd_device.state != STM32WB_USBD_DCD_STATE_READY)
    {
	return false;
    }

    stm32wb_system_unreference(STM32WB_SYSTEM_REFERENCE_USB);
    
    stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PA11_USB_DM, STM32WB_GPIO_MODE_ANALOG);
    stm32wb_gpio_pin_configure(STM32WB_GPIO_PIN_PA12_USB_DP, STM32WB_GPIO_MODE_ANALOG);

    stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_INIT;

    return true;
}

bool stm32wb_usbd_dcd_connect(bool disconnect)
{
    // armv7m_rtt_printf("DCD_CONNECT(disconnect=%d)\n", disconnect);

    if (stm32wb_usbd_dcd_device.state != STM32WB_USBD_DCD_STATE_READY)
    {
	return false;
    }

    if (disconnect)
    {
        /* Signal a DISCONNECT on the DP line by driving it low for 50uS. Specs says 2.5uS, but leave some extra margin.
         */
        stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PA12_USB_DP, 0);
        stm32wb_gpio_pin_output(STM32WB_GPIO_PIN_PA12_USB_DP);
        
        armv7m_core_udelay(50);

        stm32wb_gpio_pin_alternate(STM32WB_GPIO_PIN_PA12_USB_DP);
    }
    
    stm32wb_system_lock(STM32WB_SYSTEM_LOCK_STOP_1);

    // armv7m_rtt_printf("DCD_LOCK\n");

    stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP);

    armv7m_atomic_or(&PWR->CR2, PWR_CR2_USV);

    stm32wb_system_periph_enable(STM32WB_SYSTEM_PERIPH_USB);
    
    armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_PDWN);

    armv7m_core_udelay(50);
    
    USB->DADDR = 0;
    USB->BTABLE = 0;
    USB->LPMCSR = 0;
    USB->BCDR = 0;
    
    armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_FRES);

    USB->ISTR = (uint16_t)0;
    
    armv7m_atomic_or(&EXTI->IMR1, EXTI_IMR1_IM28);
    
    NVIC_EnableIRQ(USB_LP_IRQn);
    // NVIC_EnableIRQ(USB_HP_IRQn);
    NVIC_EnableIRQ(CRS_IRQn);

    stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_CONNECTED;
    
    armv7m_atomic_or(&stm32wb_usbd_dcd_device.events, STM32WB_USBD_DCD_EVENT_CONNECT);
        
    armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_DCD);
    
    return true;
}

bool stm32wb_usbd_dcd_disconnect(void)
{
    // armv7m_rtt_printf("DCD_DISCONNECT\n");

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_RESET)
    {
	return false;
    }

