GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
    stm32wb_lptim_timeout_stop(&stm32wb_usbd_dcd_device.timeout);
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */

    NVIC_DisableIRQ(CRS_IRQn);
    // NVIC_DisableIRQ(USB_HP_IRQn);
    NVIC_DisableIRQ(USB_LP_IRQn);

    armv7m_atomic_and(&EXTI->IMR1, ~EXTI_IMR1_IM28);

    USB->CNTR = USB_CNTR_FRES;
    USB->ISTR = (uint16_t)0;
    USB->DADDR = 0;
    USB->LPMCSR = 0;
    USB->BCDR = 0;

    USB->CNTR |= USB_CNTR_PDWN;

    stm32wb_system_periph_disable(STM32WB_SYSTEM_PERIPH_USB);
    
    armv7m_atomic_and(&PWR->CR2, ~PWR_CR2_USV);
    
    /* Signal a DISCONNECT on the DP line by driving it low for 50uS. Specs says 2.5uS, but leave some extra margin.
     */
    stm32wb_gpio_pin_write(STM32WB_GPIO_PIN_PA12_USB_DP, 0);
    stm32wb_gpio_pin_output(STM32WB_GPIO_PIN_PA12_USB_DP);

    armv7m_core_udelay(50);

    stm32wb_gpio_pin_alternate(STM32WB_GPIO_PIN_PA12_USB_DP);

    stm32wb_usbd_dcd_device.lpm_state = STM32WB_USBD_DCD_LPM_STATE_L3;

    stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_READY;

    if (stm32wb_usbd_dcd_device.state <= STM32WB_USBD_DCD_STATE_CONNECTED)
    {
        stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP);

        // armv7m_rtt_printf("DCD_UNLOCK\n");
    }

    stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_STOP_1);
    
    stm32wb_usbd_dcd_device.events = STM32WB_USBD_DCD_EVENT_DISCONNECT;
    
    armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_DCD);

    return true;
}

bool stm32wb_usbd_dcd_reset(void)
{
    uint32_t ep_index;
    
    // armv7m_rtt_printf("DCD_RESET\n");

    if (stm32wb_usbd_dcd_device.state != STM32WB_USBD_DCD_STATE_RESET)
    {
	return false;
    }
    
    stm32wb_usbd_dcd_device.ep0_count = 0;
    stm32wb_usbd_dcd_device.ep0_length = 0;

    USB_EP_CTR_RX_RESET(0);
    USB_EP_CTR_TX_RESET(0);
    
    for (ep_index = 1; ep_index < STM32WB_USBD_DCD_EP_COUNT; ep_index++)
    {
        stm32wb_usbd_dcd_device.ep_in[ep_index -1].control &= ~(STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED);
        stm32wb_usbd_dcd_device.ep_in[ep_index -1].bulk.callback = NULL;
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
        stm32wb_usbd_dcd_device.ep_in[ep_index -1].iso.callback = NULL;
        stm32wb_usbd_dcd_device.ep_in[ep_index -1].iso.fifo = NULL;
        stm32wb_usbd_dcd_device.ep_in[ep_index -1].iso.length[0] = 0;
        stm32wb_usbd_dcd_device.ep_in[ep_index -1].iso.length[1] = 0;
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
        stm32wb_usbd_dcd_device.ep_out[ep_index -1].control &= ~(STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED);
        stm32wb_usbd_dcd_device.ep_out[ep_index -1].bulk.callback = NULL;
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
        stm32wb_usbd_dcd_device.ep_out[ep_index -1].iso.callback = NULL;
        stm32wb_usbd_dcd_device.ep_out[ep_index -1].iso.fifo = NULL;
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */

        USB_EP_CTR_RX_RESET(ep_index);
        USB_EP_CTR_TX_RESET(ep_index);
    }
    
    armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_FRES);

    USB->ISTR = (uint16_t)0;
    
    USB_PMA_TX_ADDRESS(0, USB_EP0_PMA_ADDRESS);
    USB_PMA_RX_ADDRESS(0, USB_EP0_PMA_ADDRESS);
    USB_PMA_RX_SIZE(0, 0x8400);                     // 8 = 0x1000, 16 = 0x2000, 32 = 0x4000, 64 = 0x8400
    
    USB_EP_W(0, USB_EP_CONTROL);
    USB_EP_STAT_TX(0, USB_EP_TX_NAK);
    USB_EP_STAT_RX(0, USB_EP_RX_NAK);

    USB->DADDR = USB_DADDR_EF | 0x00;
    USB->LPMCSR = USB_LPMCSR_LPMEN | USB_LPMCSR_LPMACK;
    
    stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_CONNECTED;
    
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
    stm32wb_usbd_dcd_device.reference = 0;

    armv7m_atomic_orh(&USB->CNTR, (USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RESETM | USB_CNTR_L1REQM));
#else /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
    armv7m_atomic_orh(&USB->CNTR, (USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RESETM));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

#if (STM32WB_USBD_DCD_SOF_SUPPORTED == 1)
    if (stm32wb_usbd_dcd_device.sof_callback)
    {
        armv7m_atomic_orh(&USB->CNTR, USB_CNTR_SOFM);
    }
#endif /* STM32WB_USBD_DCD_SOF_SUPPORTED == 1 */

    return true;
}

bool stm32wb_usbd_dcd_address(uint8_t address)
{
    // armv7m_rtt_printf("DCD_ADDRESS(address=%02x)\n", address);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }

    USB->DADDR = (USB_DADDR_EF | address);
    
    return true;
}

#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)

static void stm32wb_usbd_dcd_wakeup_routine(void *context)
{
    uint16_t usb_cntr;
    
    if (stm32wb_usbd_dcd_device.lpm_state == STM32WB_USBD_DCD_LPM_STATE_L0)
    {
        if (stm32wb_usbd_dcd_device.set_resume)
        {
            // armv7m_rtt_printf("DCD_WAKEUP_SET_RESUME(cntr=%04x, istr=%04x)\n", USB->CNTR, USB->ISTR);

            stm32wb_usbd_dcd_device.set_resume = 0;
            
            do
            {
                usb_cntr = USB->CNTR;
                
                if (!(usb_cntr & USB_CNTR_FSUSP))
                {
                    return;
                }
            }
            while (armv7m_atomic_cash(&USB->CNTR, usb_cntr, (usb_cntr | USB_CNTR_RESUME)) != usb_cntr);

            stm32wb_usbd_dcd_device.unset_resume = 1;
            
            stm32wb_lptim_timeout_start(&stm32wb_usbd_dcd_device.timeout, STM32WB_LPTIM_TIMEOUT_MILLIS_TO_TICKS(5), stm32wb_usbd_dcd_wakeup_routine, NULL);
        }
        
        if (stm32wb_usbd_dcd_device.unset_resume)
        {
            // armv7m_rtt_printf("DCD_WAKEUP_UNSET_RESUME(cntr=%04x, istr=%04x)\n", USB->CNTR, USB->ISTR);

            stm32wb_usbd_dcd_device.unset_resume = 0;

            do
            {
                usb_cntr = USB->CNTR;
                
                if (!(usb_cntr & USB_CNTR_FSUSP))
                {
                    return;
                }
            }
            while (armv7m_atomic_cash(&USB->CNTR, usb_cntr, (usb_cntr & ~USB_CNTR_RESUME)) != usb_cntr);
            
            armv7m_atomic_or(&stm32wb_usbd_dcd_device.events, STM32WB_USBD_DCD_EVENT_RESUME);
            
            armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_DCD);
        }
    }
}

bool stm32wb_usbd_dcd_wakeup(void)
{
    uint8_t lpm_state;

    // armv7m_rtt_printf("DCD_WAKEUP(cntr=%04x, istr=%04x, %d)\n", USB->CNTR, USB->ISTR, (uint32_t)armv7m_systick_micros());

