GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }

    if (stm32wb_usbd_dcd_device.lpm_state == STM32WB_USBD_DCD_LPM_STATE_L2)
    {
        lpm_state = armv7m_atomic_swapb(&stm32wb_usbd_dcd_device.lpm_state, STM32WB_USBD_DCD_LPM_STATE_L0);

        if (lpm_state == STM32WB_USBD_DCD_LPM_STATE_L2)
        {
            // armv7m_rtt_printf("DCD_WAKEUP_RESUME\n");

            armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_LPMODE);

            // armv7m_rtt_printf("DCD_LOCK\n");

            stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP);

            stm32wb_usbd_dcd_device.set_resume = 1;
            stm32wb_usbd_dcd_device.unset_resume = 0;
            
            stm32wb_lptim_timeout_start(&stm32wb_usbd_dcd_device.timeout, STM32WB_LPTIM_TIMEOUT_MILLIS_TO_TICKS(2), stm32wb_usbd_dcd_wakeup_routine, NULL);
        }
    }

    return true;
}

#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */

#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)

bool stm32wb_usbd_dcd_lpm_reference(uint32_t reference)
{
    uint8_t lpm_state;
    uint16_t usb_cntr;

    armv7m_atomic_or(&stm32wb_usbd_dcd_device.reference, reference);
    armv7m_atomic_andh(&USB->LPMCSR, ~USB_LPMCSR_LPMACK);

    // armv7m_rtt_printf("DCD_LPM_REFERENCE(reference=%08x) = %s\n", reference, ((USB->LPMCSR & USB_LPMCSR_LPMACK) ? "ACK" : "NYET"));

    if (stm32wb_usbd_dcd_device.lpm_state == STM32WB_USBD_DCD_LPM_STATE_L1)
    {
        if (USB->LPMCSR & USB_LPMCSR_REMWAKE)
        {
            lpm_state = armv7m_atomic_swapb(&stm32wb_usbd_dcd_device.lpm_state, STM32WB_USBD_DCD_LPM_STATE_L0);
          
            if (lpm_state == STM32WB_USBD_DCD_LPM_STATE_L1)
            {
                // armv7m_rtt_printf("DCD_LPM_RESUME\n");
                
                armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_LPMODE);

                do
                {
                    usb_cntr = USB->CNTR;

                    if (!(usb_cntr & USB_CNTR_FSUSP))
                    {
                        return true;
                    }
                }
                while (armv7m_atomic_cash(&USB->CNTR, usb_cntr, (usb_cntr | USB_CNTR_L1RESUME)) != usb_cntr);

                // armv7m_rtt_printf("DCD_LOCK\n");

                stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP);
                
                armv7m_atomic_or(&stm32wb_usbd_dcd_device.events, STM32WB_USBD_DCD_EVENT_RESUME);
                
                armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_DCD);

                return true;
            }
        }
    }

    return (stm32wb_usbd_dcd_device.lpm_state == STM32WB_USBD_DCD_LPM_STATE_L1);
}

void stm32wb_usbd_dcd_lpm_unreference(uint32_t reference)
{
    if (armv7m_atomic_and(&stm32wb_usbd_dcd_device.reference, ~reference) == reference)
    {
        armv7m_atomic_orhz(&USB->LPMCSR, USB_LPMCSR_LPMACK, &stm32wb_usbd_dcd_device.reference);
    }

    // armv7m_rtt_printf("DCD_LPM_UNREFERENCE(reference=%08x) = %s\n", reference, ((USB->LPMCSR & USB_LPMCSR_LPMACK) ? "ACK" : "NYET"));
}

#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

bool stm32wb_usbd_dcd_ep0_transmit(const uint8_t *data, uint16_t length)
{
    // armv7m_rtt_printf("DCD_EP0_TRANSMIT(data=%08x, length=%d)\n", data, length);
    
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    if (length > STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE)
    {
	return false;
    }

    if (length)
    {
	stm32wb_usbd_dcd_pma_write(USB_EP0_PMA_ADDRESS, data, length);
	
	USB_PMA_TX_COUNT(0, length);
    }
    else
    {
	USB_PMA_TX_COUNT(0, 0);
    }
	
    USB_EP_STAT_TX(0, USB_EP_TX_VALID);

    return true;
}

bool stm32wb_usbd_dcd_ep0_receive(uint8_t *data, uint16_t length)
{
    // armv7m_rtt_printf("DCD_EP0_RECEIVE(data=%08x, length=%d)\n", data, length);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }

    if (length > STM32WB_USBD_DCD_EP0_MAX_PACKET_SIZE)
    {
	return false;
    }
    
    stm32wb_usbd_dcd_device.ep0_data = data;
    stm32wb_usbd_dcd_device.ep0_count = 0;
    stm32wb_usbd_dcd_device.ep0_length = length;

    USB_EP_STAT_RX(0, USB_EP_RX_VALID);

    return true;
}

uint32_t stm32wb_usbd_dcd_ep0_count(void)
{
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return 0;
    }

    return stm32wb_usbd_dcd_device.ep0_count;
}

bool stm32wb_usbd_dcd_ep0_stall(void)
{
    // armv7m_rtt_printf("DCD_EP0_STALL()\n");

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }

    USB_EP_STAT_TX(0, USB_EP_TX_STALL);
    USB_EP_STAT_RX(0, USB_EP_RX_STALL);
    
    return true;
}

static uint32_t stm32wb_usbd_dcd_pma_allocate(uint32_t ep_index, uint32_t pma_address, uint32_t pma_size)
{
    uint32_t pma_btable;
    
    pma_btable = (ep_index + 1) * 8;

    if (pma_btable < stm32wb_usbd_dcd_device.pma_btable)
    {
        pma_btable = stm32wb_usbd_dcd_device.pma_btable;
    }
    
    if (pma_address)
    {
        if (pma_address < pma_btable)
        {
            return 0;
        }
    }
    else
    {
        if (pma_size > (uint32_t)(stm32wb_usbd_dcd_device.pma_address - pma_btable))
        {
            return 0;
        }

        stm32wb_usbd_dcd_device.pma_address -= pma_size;
            
        pma_address = stm32wb_usbd_dcd_device.pma_address;
    }
        
    stm32wb_usbd_dcd_device.pma_btable = pma_btable;

    return pma_address;
}

bool stm32wb_usbd_dcd_ep_configure(uint8_t ep_addr, uint8_t type, uint16_t size, uint16_t pma_address, uint16_t *p_pma_address_return)
{
    uint32_t ep_index, ep_type, ep_dbl, pma_size;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_CONFIGURE(ep_addr=%02x, type=%02x, size=%d)\n", ep_addr, type, size);

    if (stm32wb_usbd_dcd_device.state != STM32WB_USBD_DCD_STATE_INIT)
    {
	return false;
    }

    if (size == 0)
    {
	return false;
    }

