GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
    ep_index = ep_addr & 0x07;
    ep_type = type & 3;
#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
    ep_dbl = type & 4;
#else /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
    ep_dbl = 0;
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
    
    ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];
    ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

    if (ep_addr & 0x80)
    {
        if (ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED)
	{
	    return false;
	}

        size = (size + 1) & ~1;
        
	if (ep_type == STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO)
	{
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
            if (ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED)
	    {
		return false;
	    }
	    
	    pma_size = size * 2;
#else /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
            return false;
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
	}
	else
	{
            if ((ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED) && ((ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK) != ep_type))
            {
                return false;
            }

#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
            if (ep_dbl)
            {
                pma_size = size * 2;
            }
            else
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
            {
                pma_size = size;
            }
	}

        pma_address = stm32wb_usbd_dcd_pma_allocate(ep_index, pma_address, pma_size);

        if (!pma_address)
        {
            return false;
        }
        
	ep_in->control = (pma_address << STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS_SHIFT) | STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | ep_type | ep_dbl;
	ep_in->size = size;
    }
    else
    {
        if (ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED)
	{
	    return false;
	}

        if (size >= 64)
        {
            size = (size + 31) & ~31;
        }
        else
        {
            size = (size + 1) & ~1;
        }

	if (ep_type == STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO)
	{
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
            if (ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED)
	    {
		return false;
	    }
	    
	    pma_size = size * 2;
#else /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
            return false;
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
	}
	else
	{
            if ((ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED) && ((ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK) != ep_type))
            {
                return false;
            }

#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
            if (ep_dbl)
            {
                pma_size = size * 2;
            }
            else
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
            {
                pma_size = size;
            }
	}

        pma_address = stm32wb_usbd_dcd_pma_allocate(ep_index, pma_address, pma_size);

        if (!pma_address)
        {
            return false;
        }
        
	ep_out->control = (pma_address << STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS_SHIFT) | STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | ep_type | ep_dbl;
	ep_out->size = size;
    }

    if (p_pma_address_return)
    {
        *p_pma_address_return = pma_address;
    }
    
    return true;
}

bool stm32wb_usbd_dcd_ep_enable(uint8_t ep_addr)
{
    uint32_t ep_index, ep_type, ep_size;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_ENABLE(ep_addr=%02x)\n", ep_addr);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_ENABLED)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED))
	{
	    return false;
	}

	ep_type = ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK;

#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
	if (ep_type == STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO)
	{
            return false;
	}
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
	
	ep_in->control |= STM32WB_USBD_DCD_EP_CONTROL_ENABLED;

        USB_EP_CONFIG(ep_index, (stm32wb_usbd_dcd_xlate_ep_type[ep_type] | ep_index));

#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
	if (!(ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_DBL))
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
        {
            USB_PMA_TX_ADDRESS(ep_index, STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control));
        }
        
        USB_EP_DTOG_TX_RESET(ep_index);
        USB_EP_STAT_TX(ep_index, USB_EP_TX_NAK);
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if ((ep_out->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_ENABLED)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED))
	{
	    return false;
	}

	ep_type = ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK;
	
#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
	if (ep_type == STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO)
	{
            return false;
	}
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
	
	ep_out->control |= STM32WB_USBD_DCD_EP_CONTROL_ENABLED;

	if (ep_out->size >= 64)
	{
	    ep_size = 0x8000 | (((ep_out->size - 32) / 32) << 10);
	}
	else
	{
	    ep_size = 0x0000 | ((ep_out->size / 2) << 10);
	}

        USB_EP_CONFIG(ep_index, (stm32wb_usbd_dcd_xlate_ep_type[ep_type] | ep_index));

#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
	if (!(ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_DBL))
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
        {
            USB_PMA_RX_ADDRESS(ep_index, STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control));
        }
        
        USB_PMA_RX_SIZE(ep_index, ep_size);
	
        USB_EP_DTOG_RX_RESET(ep_index);
        USB_EP_STAT_RX(ep_index, USB_EP_RX_NAK);
    }

    // armv7m_rtt_printf("DCD_EP_STATUS(%d) = %04x\n", ep_index, USB_EP_R(ep_index));
    
    return true;
}

bool stm32wb_usbd_dcd_ep_disable(uint8_t ep_addr)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_DISABLE(ep_addr=%02x)\n", ep_addr);
    
