GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }

    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if (!(ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_ENABLED))
	{
	    return false;
	}
	
        USB_EP_STAT_TX(ep_index, USB_EP_TX_DIS);
        USB_EP_CTR_TX_RESET(ep_index);
        
        ep_in->bulk.callback = NULL;

	ep_in->control &= ~(STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED);
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if (!(ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_ENABLED))
	{
	    return false;
	}

        USB_EP_STAT_RX(ep_index, USB_EP_RX_DIS);
        USB_EP_CTR_RX_RESET(ep_index);

        ep_out->bulk.callback = NULL;

	ep_out->control &= ~(STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED);
    }

    // armv7m_rtt_printf("DCD_EP_STATUS(%d) = %04x\n", ep_index, USB_EP_R(ep_index));

    return true;
}

bool stm32wb_usbd_dcd_ep_stall(uint8_t ep_addr)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_STALL(ep_addr=%02x)\n", ep_addr);
    
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED)) != STM32WB_USBD_DCD_EP_CONTROL_ENABLED)
	{
	    return false;
	}

        USB_EP_STAT_TX(ep_index, USB_EP_TX_STALL);
        USB_EP_CTR_TX_RESET(ep_index);

	ep_in->bulk.callback = NULL;

	ep_in->control |= STM32WB_USBD_DCD_EP_CONTROL_STALLED;
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if ((ep_out->control & (STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED)) != STM32WB_USBD_DCD_EP_CONTROL_ENABLED)
	{
	    return false;
	}

        USB_EP_STAT_RX(ep_index, USB_EP_RX_STALL);
        USB_EP_CTR_RX_RESET(ep_index);

	ep_out->bulk.callback = NULL;

	ep_out->control |= STM32WB_USBD_DCD_EP_CONTROL_STALLED;
    }

    // armv7m_rtt_printf("DCD_EP_STATUS(%d) = %04x\n", ep_index, USB_EP_R(ep_index));
    
    return true;
}

bool stm32wb_usbd_dcd_ep_unstall(uint8_t ep_addr)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_UNSTALL(ep_addr=%02x)\n", ep_addr);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if (!(ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_STALLED))
	{
	    return false;
	}
	
	ep_in->control &= ~STM32WB_USBD_DCD_EP_CONTROL_STALLED;

        USB_EP_DTOG_TX_RESET(ep_index);
        USB_EP_STAT_TX(ep_index, USB_EP_TX_NAK);
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if (!(ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_STALLED))
	{
	    return false;
	}

	ep_out->control &= ~STM32WB_USBD_DCD_EP_CONTROL_STALLED;

        USB_EP_DTOG_RX_RESET(ep_index);
        USB_EP_STAT_RX(ep_index, USB_EP_RX_NAK);
    }

    // armv7m_rtt_printf("DCD_EP_STATUS(%d) = %04x\n", ep_index, USB_EP_R(ep_index));
    
    return true;
}

bool stm32wb_usbd_dcd_ep_is_stalled(uint8_t ep_addr)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_IS_STALLED(ep_addr=%02x)\n", ep_addr);
    
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	return !!(ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_STALLED);
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	return !!(ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_STALLED);
    }
}

bool stm32wb_usbd_dcd_ep_transmit(uint8_t ep_addr, const uint8_t *data, uint16_t length, stm32wb_usbd_dcd_ep_in_callback_t callback, void *context)
{
    uint32_t ep_index, pma_address, count;
#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
    uint32_t sequence;
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
    stm32wb_usbd_dcd_ep_in_t *ep_in;

    // armv7m_rtt_printf("DCD_EP_TRANSMIT(ep_addr=%02x, data=%08x, length=%d, callback=%08x, context=%0x)\n", ep_addr, data, length, callback, context);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];
    
    if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED)) != STM32WB_USBD_DCD_EP_CONTROL_ENABLED)
    {
        return false;
    }
    
    if (ep_in->bulk.callback)
    {
        return false;
    }
    
    ep_in->bulk.data = data;
    ep_in->bulk.length = length;
    ep_in->bulk.count = 0;
    ep_in->bulk.callback = callback;
    ep_in->bulk.context = context;

#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
    if (ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_DBL)
    {
        sequence = USB_EP_DTOG_TX_STATUS(ep_index);
            
        if (ep_in->bulk.length)
        {
            pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control) + (sequence ? ep_in->size : 0);
            
            count = ep_in->bulk.length;
            
            if (count > ep_in->size)
            {
                count = ep_in->size;
            }
            
            stm32wb_usbd_dcd_pma_write(pma_address, ep_in->bulk.data, count);
            
            ep_in->bulk.data += count;
            ep_in->bulk.length -= count;
            
            USB_PMA_TX_ADDRESS(ep_index, pma_address);
            USB_PMA_TX_COUNT(ep_index, count);
            
            if (ep_in->bulk.length)
            {
                count = ep_in->bulk.length;
                
                if (count > ep_in->size)
                {
                    count = ep_in->size;
                }
                
                if (count)
                {
                    pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control) + (sequence ? 0 : ep_in->size);
                    
                    stm32wb_usbd_dcd_pma_write(pma_address, ep_in->bulk.data, count);
                    
                    ep_in->bulk.count = count;
                }
            }
        }
        else
        {
            USB_PMA_TX_COUNT(ep_index, 0);
        }
    }
    else
#endif
    {
        if (ep_in->bulk.length)
        {
            pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control);
        
            count = ep_in->bulk.length;
        
            if (count > ep_in->size)
            {
                count = ep_in->size;
            }
        
            stm32wb_usbd_dcd_pma_write(pma_address, ep_in->bulk.data, count);
        
            ep_in->bulk.data += count;
            ep_in->bulk.length -= count;
        
            USB_PMA_TX_COUNT(ep_index, count);
        }
        else
        {
            USB_PMA_TX_COUNT(ep_index, 0);
        }
    }

