GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
    USB_EP_STAT_TX(ep_index, USB_EP_TX_VALID);
    
    return true;
}

bool stm32wb_usbd_dcd_ep_receive(uint8_t ep_addr, uint8_t *data, uint16_t length, stm32wb_usbd_dcd_ep_out_callback_t callback, void *context)
{
    uint32_t ep_index;
#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
    uint32_t pma_address, sequence;
#endif /* (STM32WB_USBD_DCD_DBL_SUPPORTED == 1) */
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_RECEIVE(ep_addr=%02x, data=%08x, legnth=%d, callback=%08x, context=%0x)\n", ep_addr, data, length, callback, context);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];
    
    if ((ep_out->control & (STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED)) != STM32WB_USBD_DCD_EP_CONTROL_ENABLED)
    {
        return false;
    }

    if (ep_out->bulk.callback)
    {
        return false;
    }
    
    ep_out->bulk.data = data;
    ep_out->bulk.count = 0;
    ep_out->bulk.length = length;
    ep_out->bulk.callback = callback;
    ep_out->bulk.context = context;

#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
    if (ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_DBL)
    {
        sequence = USB_EP_DTOG_RX_STATUS(ep_index);

        pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control) + (sequence ? ep_out->size : 0);

        USB_PMA_RX_ADDRESS(ep_index, pma_address);
    }
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */

    USB_EP_STAT_RX(ep_index, USB_EP_RX_VALID);

    return true;
}

bool stm32wb_usbd_dcd_ep_flush(uint8_t ep_addr)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_FLUSH(ep_addr=%02x)\n", ep_addr);
    
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

        if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED)) != STM32WB_USBD_DCD_EP_CONTROL_ENABLED)
	{
	    return false;
	}

	ep_in->bulk.callback = NULL;

        USB_EP_STAT_TX(ep_index, USB_EP_TX_NAK);
        USB_EP_CTR_TX_RESET(ep_index);
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

        if ((ep_out->control & (STM32WB_USBD_DCD_EP_CONTROL_ENABLED | STM32WB_USBD_DCD_EP_CONTROL_STALLED)) != STM32WB_USBD_DCD_EP_CONTROL_ENABLED)
	{
	    return false;
	}
	
	ep_out->bulk.callback = NULL;

        USB_EP_STAT_RX(ep_index, USB_EP_RX_NAK);
        USB_EP_CTR_RX_RESET(ep_index);
    }

    return true;
}

static void stm32wb_usbd_dcd_event(void)
{
    uint32_t events;
#if (STM32WB_USBD_DCD_LSE_SUPPORTED == 1)
    uint32_t lseclk;
#endif /* STM32WB_USBD_DCD_LSE_SUPPORTED == 1 */
    uint8_t clk48_on;

    events = armv7m_atomic_swap(&stm32wb_usbd_dcd_device.events, 0);

    // armv7m_rtt_printf("DCD_EVENT_ENTER(state=%d, lpm_state=%d, events=%08x, %d)\n", stm32wb_usbd_dcd_device.state, stm32wb_usbd_dcd_device.lpm_state, events, (uint32_t)armv7m_systick_micros());
    
    if (events & STM32WB_USBD_DCD_EVENT_RESET)
    {
        events &= ~(STM32WB_USBD_DCD_EVENT_EP0_SETUP | STM32WB_USBD_DCD_EVENT_EP0_DATA_IN | STM32WB_USBD_DCD_EVENT_EP0_DATA_OUT | STM32WB_USBD_DCD_EVENT_SLEEP | STM32WB_USBD_DCD_EVENT_SUSPEND | STM32WB_USBD_DCD_EVENT_RESUME);
    }

    clk48_on = stm32wb_usbd_dcd_device.clk48_on;

    if (events & (STM32WB_USBD_DCD_EVENT_DISCONNECT | STM32WB_USBD_DCD_EVENT_SLEEP | STM32WB_USBD_DCD_EVENT_SUSPEND))
    {
        clk48_on = false;
    }
    
    if (events & (STM32WB_USBD_DCD_EVENT_CONNECT | STM32WB_USBD_DCD_EVENT_RESUME | STM32WB_USBD_DCD_EVENT_RESET))
    {
        clk48_on = true;
    }
    
    if (stm32wb_usbd_dcd_device.clk48_on != clk48_on)
    {
        if (stm32wb_usbd_dcd_device.clk48_on)
        {
            if (!stm32wb_hsem_lock(STM32WB_HSEM_INDEX_RNG, STM32WB_HSEM_PROCID_USBD_DCD))
            {
                if (!stm32wb_hsem_is_locked(STM32WB_HSEM_INDEX_RNG, STM32WB_HSEM_PROCID_RNG))
                {
                    armv7m_atomic_or(&stm32wb_usbd_dcd_device.events, events);

                    // armv7m_rtt_printf("DCD_EVENT_LEAVE(CLK48_OFF)\n");
                    
                    return;
                }
            }

            CRS->CR &= ~(CRS_CR_AUTOTRIMEN | CRS_CR_CEN | CRS_CR_SYNCOKIE);

            armv7m_atomic_and(&RCC->APB1ENR1, ~RCC_APB1ENR1_CRSEN);
            
            stm32wb_system_clk48_disable();

            stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RNG, STM32WB_HSEM_PROCID_USBD_DCD);

            stm32wb_usbd_dcd_device.clk48_on = false;
            
            // armv7m_rtt_printf("DCD_CLK48_OFF(%d)\n", (uint32_t)armv7m_systick_micros());
        }
        else 
        {
            if (!stm32wb_hsem_lock(STM32WB_HSEM_INDEX_RNG, STM32WB_HSEM_PROCID_USBD_DCD))
            {
                if (!stm32wb_hsem_is_locked(STM32WB_HSEM_INDEX_RNG, STM32WB_HSEM_PROCID_RNG))
                {
                    armv7m_atomic_or(&stm32wb_usbd_dcd_device.events, events);

                    // armv7m_rtt_printf("DCD_EVENT_LEAVE(CLK48_ON)\n");
                    
                    return;
                }
            }

            stm32wb_system_clk48_enable();

            stm32wb_hsem_unlock(STM32WB_HSEM_INDEX_RNG, STM32WB_HSEM_PROCID_USBD_DCD);

            stm32wb_usbd_dcd_device.clk48_on = true;

            // armv7m_rtt_printf("DCD_CLK48_ON(%d)\n", (uint32_t)armv7m_systick_micros());

            armv7m_atomic_or(&RCC->APB1ENR1, RCC_APB1ENR1_CRSEN);
            RCC->APB1ENR1;

#if (STM32WB_USBD_DCD_LSE_SUPPORTED == 1)
            lseclk = stm32wb_system_lseclk();
            
            if (lseclk)
            {
                CRS->CFGR = (((((48000000 + (lseclk -1)) / lseclk) -1) << CRS_CFGR_RELOAD_Pos) | (1 << CRS_CFGR_FELIM_Pos) | CRS_CFGR_SYNCSRC_0);
            }
            else
#endif /* STM32WB_USBD_DCD_LSE_SUPPORTED == 1 */
            {
                // 0.11% step !!!
                CRS->CFGR = (((48000 -1) << CRS_CFGR_RELOAD_Pos) | (26 << CRS_CFGR_FELIM_Pos) | CRS_CFGR_SYNCSRC_1);
            }
            
            CRS->ICR = CRS_ICR_SYNCOKC;
            CRS->CR |= (CRS_CR_AUTOTRIMEN | CRS_CR_CEN | (!stm32wb_usbd_dcd_device.clk48_sync ? CRS_CR_SYNCOKIE : 0));
        }
    }
    
    if (events & STM32WB_USBD_DCD_EVENT_CONNECT)
    {
        USB->BCDR = USB_BCDR_DPPU;

        if (!stm32wb_usbd_dcd_device.clk48_sync)
        {
            armv7m_atomic_or(&stm32wb_usbd_dcd_device.events, events);

            // armv7m_rtt_printf("DCD_EVENT_LEAVE(CLK48_SYNC)\n");
                    
            return;
        }

        CRS->CR &= ~CRS_CR_SYNCOKIE;
        
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
        armv7m_atomic_orh(&USB->CNTR, (USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RESETM | USB_CNTR_L1REQM));
#else /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
        armv7m_atomic_orh(&USB->CNTR, (USB_CNTR_CTRM | USB_CNTR_WKUPM | USB_CNTR_SUSPM | USB_CNTR_RESETM));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
    }

    if (events & STM32WB_USBD_DCD_EVENT_RESET)
    {
        stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_RESET;
    }
    
    if (events & (STM32WB_USBD_DCD_EVENT_SLEEP | STM32WB_USBD_DCD_EVENT_SUSPEND))
    {
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
        stm32wb_usbd_dcd_device.state = (events & STM32WB_USBD_DCD_EVENT_SLEEP) ? STM32WB_USBD_DCD_STATE_SLEEP: STM32WB_USBD_DCD_STATE_SUSPENDED;
#else /*STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
        stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_SLEEP;
#endif /*STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
    }

    if (events & STM32WB_USBD_DCD_EVENT_RESUME)
    {
        armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_FSUSP);

#if (STM32WB_USBD_DCD_SOF_SUPPORTED == 1)
        if (stm32wb_usbd_dcd_device.sof_callback)
        {
            armv7m_atomic_orh(&USB->CNTR, USB_CNTR_SOFM);
        }
#endif /* STM32WB_USBD_DCD_SOF_SUPPORTED == 1 */

