GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
        stm32wb_usbd_dcd_device.state = STM32WB_USBD_DCD_STATE_CONNECTED;
    }
    
    if (events)
    {
        // armv7m_rtt_printf("DCD_EVENT_LEAVE(CALLBACK, state=%d, events=%08x)\n", stm32wb_usbd_dcd_device.state, events);

        (*stm32wb_usbd_dcd_device.evt_callback)(stm32wb_usbd_dcd_device.evt_context, events);
    }
    else
    {
        // armv7m_rtt_printf("DCD_EVENT_LEAVE(RETURN, state=%d)\n", stm32wb_usbd_dcd_device.state);
    }
}

#if (STM32WB_USBD_DCD_SOF_SUPPORTED == 1)

bool stm32wb_usbd_dcd_sof_enable(stm32wb_usbd_dcd_sof_callback_t callback, void *context)
{
    // armv7m_rtt_printf("DCD_SOF_ENABLE()\n");

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_RESET)
    {
	return false;
    }

    armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_SOFM);

    USB->ISTR = (uint16_t)~USB_ISTR_SOF;

    stm32wb_usbd_dcd_device.sof_callback = callback;
    stm32wb_usbd_dcd_device.sof_context = context;
    
    if (stm32wb_usbd_dcd_device.state == STM32WB_USBD_DCD_STATE_CONNECTED)
    {
        armv7m_atomic_orh(&USB->CNTR, USB_CNTR_SOFM);
    }
    
    return true;
}

bool stm32wb_usbd_dcd_sof_disable()
{
    // armv7m_rtt_printf("DCD_SOF_DISABLE()\n");

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_RESET)
    {
	return false;
    }

    armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_SOFM);

    USB->ISTR = (uint16_t)~USB_ISTR_SOF;

    stm32wb_usbd_dcd_device.sof_callback = NULL;
    stm32wb_usbd_dcd_device.sof_context = NULL;
    
    return true;
}

#endif /* STM32WB_USBD_DCD_SOF_SUPPORTED == 1 */

#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)

uint16_t stm32wb_usbd_dcd_fifo_count(stm32wb_usbd_dcd_fifo_t *fifo)
{
    return fifo->count;
}

uint16_t stm32wb_usbd_dcd_fifo_write(stm32wb_usbd_dcd_fifo_t *fifo, const uint8_t *data, uint16_t length)
{
    uint32_t count, tail;

    count = fifo->size - fifo->count;
    tail = fifo->tail;

    if (length > count)
    {
        length = count;
    }

    if (length)
    {
        count = length;
        
        if (count > (uint32_t)(fifo->size - tail))
        {
            count = fifo->size - tail;
        }

        memcpy(&fifo->data[tail], &data[0], count);

        if (count != length)
        {
            memcpy(&fifo->data[0], &data[count], (length - count));
        }
        
        tail += length;
    
        if (tail >= fifo->size)
        {
            tail -= fifo->size;
        }

        fifo->tail = tail;

        armv7m_atomic_addh(&fifo->count, length);
    }
    
    return length;
}

uint16_t stm32wb_usbd_dcd_fifo_read(stm32wb_usbd_dcd_fifo_t *fifo, uint8_t *data, uint16_t length)
{
    uint32_t count, head;

    count = fifo->count;
    head = fifo->head;

    if (length > count)
    {
        length = count;
    }
    
    if (length)
    {
        if (data)
        {
            count = length;
            
            if (count > (uint32_t)(fifo->size - head))
            {
                count = fifo->size - head;
            }
            
            memcpy(&data[0], &fifo->data[head], count);
            
            if (count != length)
            {
                memcpy(&data[count], &fifo->data[0], (length - count));
            }
        }
        
        head += length;
            
        if (head >= fifo->size)
        {
            head -= fifo->size;
        }
        
        fifo->head = head;

        armv7m_atomic_subh(&fifo->count, length);
    }
    
    return length;
}

static uint32_t stm32wb_usbd_dcd_fifo_pma_write(stm32wb_usbd_dcd_fifo_t *fifo, uint32_t pma_address, uint32_t length)
{
    uint32_t count, head;

    count = fifo->count;
    head = fifo->head;

    if (length > count)
    {
        length = count;
    }

    if (length)
    {
        count = length;
        
        if (count > (uint32_t)(fifo->size - head))
        {
            count = fifo->size - head;
        }

        stm32wb_usbd_dcd_pma_write(pma_address, &fifo->data[head], count);

        if (length != count)
        {
            stm32wb_usbd_dcd_pma_write(pma_address + count, &fifo->data[0], (length - count));
        }
        
        head += length;
    
        if (head >= fifo->size)
        {
            head -= fifo->size;
        }
        
        fifo->head = head;
        
        armv7m_atomic_subh(&fifo->count, length);
    }
    
    return length;
}

static uint32_t stm32wb_usbd_dcd_fifo_pma_read(stm32wb_usbd_dcd_fifo_t *fifo, uint32_t pma_address, uint32_t length)
{
    uint32_t count, tail;

    count = fifo->size - fifo->count;
    tail = fifo->tail;

    if (length > count)
    {
        length = count;
    }

    if (length)
    {
        count = length;

        if (count > (uint32_t)(fifo->size - tail))
        {
            count = fifo->size - tail;
        }

        stm32wb_usbd_dcd_pma_read(pma_address, &fifo->data[tail], count);

        if (length != count)
        {
            stm32wb_usbd_dcd_pma_read(pma_address + count, &fifo->data[0], (length - count));
        }
    
        tail += length;
    
        if (tail >= fifo->size)
        {
            tail -= fifo->size;
        }

        fifo->tail = tail;

        armv7m_atomic_addh(&fifo->count, length);
    }
    
    return length;
}

static void stm32wb_usbd_dcd_ep_iso_in_routine(uint32_t ep_index, stm32wb_usbd_dcd_ep_in_t *ep_in)
{
    uint32_t sequence, count;
    stm32wb_usbd_dcd_ep_iso_callback_t ep_iso_callback;
    void *ep_iso_context;

    sequence = USB_EP_DTOG_RX_STATUS(ep_index) ^ 1;
    count = ep_in->iso.length[sequence] & 0x03ff;

    ep_in->iso.length[sequence] = 0;

    if (sequence == 0)
    {
        USB_PMA_TX_0_COUNT(ep_index, 0);
    }
    else
    {
        USB_PMA_TX_1_COUNT(ep_index, 0);
    }
    
    // armv7m_rtt_printf("DCD_EP_ISO_IN_CALLBACK(ep_addr=%02x)\n", (ep_index | 0x80), count);
    
    ep_iso_callback = ep_in->iso.callback;
    ep_iso_context = ep_in->iso.context;

    if (ep_iso_callback)
    {
        (*ep_iso_callback)(ep_iso_context, (ep_index | 0x80), count);
    }
}

