GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
static void stm32wb_usbd_dcd_ep_iso_out_routine(uint32_t ep_index, stm32wb_usbd_dcd_ep_out_t *ep_out)
{
    uint32_t sequence, pma_address, length;
    stm32wb_usbd_dcd_ep_iso_callback_t ep_iso_callback;
    void *ep_iso_context;

    sequence = USB_EP_DTOG_TX_STATUS(ep_index) ^ 1;

    pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control) + (sequence ? ep_out->size : 0);
    
    if (sequence == 0)
    {
        length = USB_PMA_RX_0_COUNT(ep_index);
    }
    else
    {
        length = USB_PMA_RX_1_COUNT(ep_index);
    }

    if (length)
    {
        length = stm32wb_usbd_dcd_fifo_pma_read(ep_out->iso.fifo, pma_address, length);
    }

    // armv7m_rtt_printf("DCD_EP_ISO_OUT_CALLBACK(ep_addr=%02x, count=%d)\n", (ep_index | 0x00), length);
    
    ep_iso_callback = ep_out->iso.callback;
    ep_iso_context = ep_out->iso.context;

    if (ep_iso_callback)
    {
        (*ep_iso_callback)(ep_iso_context, (ep_index | 0x00), length);
    }
}

bool stm32wb_usbd_dcd_ep_fifo_attach(uint8_t ep_addr, stm32wb_usbd_dcd_fifo_t *fifo, uint8_t *data, uint16_t size)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_FIFO_ATTACH(ep_addr=%02x, fifo=%08x, data=%08x, size=%d)\n", ep_addr, fifo, data, size);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_RESET)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO))
	{
	    return false;
	}

        ep_in->iso.fifo = fifo;
        ep_in->iso.length[0] = 0;
        ep_in->iso.length[1] = 0;
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if ((ep_out->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO))
	{
	    return false;
	}

        ep_out->iso.fifo = fifo;
    }

    fifo->data = data;
    fifo->size = size;
    fifo->head = 0;
    fifo->tail = 0;
    fifo->count = 0;

    return true;
}

bool stm32wb_usbd_dcd_ep_fifo_detach(uint8_t ep_addr)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_FIFO_DEATTACH(ep_addr=%02x)\n", ep_addr);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_RESET)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO))
	{
	    return false;
	}

        ep_in->iso.fifo = NULL;
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if ((ep_out->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO))
	{
	    return false;
	}

        ep_out->iso.fifo = NULL;
    }

    return true;
}

bool stm32wb_usbd_dcd_ep_iso_start(uint8_t ep_addr, stm32wb_usbd_dcd_ep_iso_callback_t callback, void *context)
{
    uint32_t ep_index, ep_size;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_ENABLE(ep_addr=%02x)\n", ep_addr);

    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }
    
    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO))
	{
	    return false;
	}

        if (!ep_in->iso.fifo || !ep_in->iso.length[0] || !ep_in->iso.length[1])
        {
            return false;
        }

        stm32wb_usbd_dcd_device.iso_in_routine = stm32wb_usbd_dcd_ep_iso_in_routine;
        
        ep_in->iso.callback = callback;
        ep_in->iso.context = context;
	ep_in->control |= STM32WB_USBD_DCD_EP_CONTROL_STARTED;

	USB_EP_CONFIG(ep_index, (USB_EP_ISOCHRONOUS | ep_index));

        USB_PMA_TX_0_ADDRESS(ep_index, STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control));
        USB_PMA_TX_1_ADDRESS(ep_index, STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control) + ep_in->size);

        USB_EP_DTOG_TX_RESET(ep_index);
        USB_EP_STAT_RX(ep_index, USB_EP_RX_DIS);
        USB_EP_STAT_TX(ep_index, USB_EP_TX_VALID);
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if ((ep_out->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_STARTED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO))
	{
	    return false;
	}

        if (!ep_out->iso.fifo)
        {
            return false;
        }

        stm32wb_usbd_dcd_device.iso_out_routine = stm32wb_usbd_dcd_ep_iso_out_routine;

        ep_out->iso.callback = callback;
        ep_out->iso.context = context;

	ep_out->control |= STM32WB_USBD_DCD_EP_CONTROL_STARTED;

	if (ep_out->size >= 64)
	{
	    ep_size = 0x8000 | (((ep_out->size - 32) / 32) << 10);
	}
	else
	{
	    ep_size = 0x0000 | ((ep_out->size / 2) << 10);
	}

	USB_EP_CONFIG(ep_index, (USB_EP_ISOCHRONOUS | ep_index));

        USB_PMA_RX_0_ADDRESS(ep_index, STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control));
        USB_PMA_RX_0_SIZE(ep_index, ep_size);
        USB_PMA_RX_1_ADDRESS(ep_index, STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control) + ep_out->size);
        USB_PMA_RX_1_SIZE(ep_index, ep_size);
	    
        USB_EP_DTOG_RX_RESET(ep_index);
        USB_EP_STAT_TX(ep_index, USB_EP_TX_DIS);
        USB_EP_STAT_RX(ep_index, USB_EP_RX_VALID);
    }

