GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
    return true;
}

bool stm32wb_usbd_dcd_ep_iso_stop(uint8_t ep_addr)
{
    uint32_t ep_index;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;

    // armv7m_rtt_printf("DCD_EP_DISABLE(ep_addr=%02x)\n", ep_addr);
    
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }

    ep_index = ep_addr & 0x07;

    if (ep_addr & 0x80)
    {
	ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

	if (!(ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_STARTED))
	{
	    return false;
	}
	
	USB_EP_STAT_TX(ep_index, USB_EP_TX_DIS);
        USB_EP_CTR_TX_RESET(ep_index);
	
        ep_in->iso.callback = NULL;
        ep_in->iso.fifo->head = 0;
        ep_in->iso.fifo->tail = 0;
        ep_in->iso.fifo->count = 0;
        ep_in->iso.length[0] = 0;
        ep_in->iso.length[1] = 0;

	ep_in->control &= ~STM32WB_USBD_DCD_EP_CONTROL_STARTED;
    }
    else
    {
	ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

	if (!(ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_STARTED))
	{
	    return false;
	}

	USB_EP_STAT_RX(ep_index, USB_EP_RX_DIS);
        USB_EP_CTR_RX_RESET(ep_index);
	
        ep_out->iso.callback = NULL;

	ep_out->control &= ~STM32WB_USBD_DCD_EP_CONTROL_STARTED;
    }

    return true;
}

bool stm32wb_usbd_dcd_ep_iso_transmit(uint8_t ep_addr, uint16_t length)
{
    uint32_t ep_index, sequence, pma_address;
    stm32wb_usbd_dcd_ep_in_t *ep_in;

    // armv7m_rtt_printf("DCD_EP_ISP_TRANSMIT(ep_addr=%02x, length=%d)\n", ep_addr, length);
    
    if (stm32wb_usbd_dcd_device.state < STM32WB_USBD_DCD_STATE_CONNECTED)
    {
	return false;
    }

    ep_index = ep_addr & 0x07;

    ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

    if ((ep_in->control & (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK)) != (STM32WB_USBD_DCD_EP_CONTROL_CONFIGURED | STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO))
    {
        return false;
    }

    if (!(ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_STARTED))
    {
        if      (!ep_in->iso.length[0]) { sequence = 0; }
        else if (!ep_in->iso.length[1]) { sequence = 1; }
        else
        {
            return false;
        }
    }
    else
    {
        sequence = USB_EP_DTOG_TX_STATUS(ep_index) ^ 1;
    }
    
    if (length)
    {
        pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control) + (sequence ? ep_in->size : 0);
        
        length = stm32wb_usbd_dcd_fifo_pma_write(ep_in->iso.fifo, pma_address, length);
    }
    
    if (sequence == 0)
    {
        USB_PMA_TX_0_COUNT(ep_index, length);
    }
    else
    {
        USB_PMA_TX_1_COUNT(ep_index, length);
    }

    ep_in->iso.length[sequence] = length | 0x8000;
    
    return true;
}

#endif /* STM32WB_USBD_DCD_ISO_SUPPORTED == 1 */

static void __attribute__((optimize("O3"))) stm32wb_usbd_dcd_interrupt()
{
    uint32_t usb_istr, usb_ep, ep_index, pma_address, count, events;
#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
    uint32_t sequence;
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
    uint8_t lpm_state;
    stm32wb_usbd_dcd_ep_in_t *ep_in;
    stm32wb_usbd_dcd_ep_out_t *ep_out;
    stm32wb_usbd_dcd_ep_in_callback_t ep_in_callback;
    stm32wb_usbd_dcd_ep_out_callback_t ep_out_callback;
    void *ep_in_context, *ep_out_context;

    events = 0;

    usb_istr = USB->ISTR;

    // // armv7m_rtt_printf("DCD_ISR_ENTER(cntr=%04x, istr=%04x, fnr=%08x, %d)\n", USB->CNTR, usb_istr, USB->FNR, (uint32_t)armv7m_systick_micros());
    
    if (usb_istr & USB_ISTR_CTR)
    {
	do
	{
 	    ep_index = usb_istr & USB_ISTR_EP_ID;

	    if (ep_index == 0)
	    {
		usb_ep = USB_EP_R(0);

		if (usb_istr & USB_ISTR_DIR)
		{
		    count = USB_PMA_RX_COUNT(0);

		    if (usb_ep & USB_EP_SETUP)
		    {
		        stm32wb_usbd_dcd_pma_read(USB_EP0_PMA_ADDRESS, stm32wb_usbd_dcd_device.ep0_setup, count);

			USB_EP_CTR_RX_RESET(0);
			    
			events |= STM32WB_USBD_DCD_EVENT_EP0_SETUP;
		    }
		    else
		    {
			if (count > stm32wb_usbd_dcd_device.ep0_length)
			{
			    count = stm32wb_usbd_dcd_device.ep0_length;
			}

			if (count)
			{
			    stm32wb_usbd_dcd_pma_read(USB_EP0_PMA_ADDRESS, stm32wb_usbd_dcd_device.ep0_data, count);
			}

			stm32wb_usbd_dcd_device.ep0_count = count;

			USB_EP_CTR_RX_RESET(0);
                        
			events |= STM32WB_USBD_DCD_EVENT_EP0_DATA_OUT;
		    }
		}
		
		if (usb_ep & USB_EP_CTR_TX)
		{
		    USB_EP_CTR_TX_RESET(0);
                    
		    events |= STM32WB_USBD_DCD_EVENT_EP0_DATA_IN;
		}
	    }
	    else
	    {
		usb_ep = USB_EP_R(ep_index);

		if (usb_ep & USB_EP_CTR_RX)
		{
                    USB_EP_CTR_RX_RESET(ep_index);

		    ep_out = &stm32wb_usbd_dcd_device.ep_out[ep_index -1];

#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
		    if ((ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK) == STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO)
		    {
			/* ISO */

                        (*stm32wb_usbd_dcd_device.iso_out_routine)(ep_index, ep_out);
		    }
		    else
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
                    {
			/* BULK / INTERRUPT */

                        count = USB_PMA_RX_COUNT(ep_index);

#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
                        if (ep_out->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_DBL)
                        {
                            sequence = (usb_ep & USB_EP_DTOG_RX) ? 1 : 0;

                            if ((count == ep_out->size) && (ep_out->bulk.length > ep_out->size))
                            {
                                pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control) + (sequence ? ep_out->size : 0);
                            
                                USB_PMA_RX_ADDRESS(ep_index, pma_address);
                                    
                                USB_EP_STAT_RX(ep_index, USB_EP_RX_VALID);

                                pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control) + (sequence ? 0 : ep_out->size);
                                
