GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
                                stm32wb_usbd_dcd_pma_read(pma_address, ep_out->bulk.data, count);

                                ep_out->bulk.data += count;
                                ep_out->bulk.count += count;
                                ep_out->bulk.length -= count;
                            }
                            else
                            {
                                if (count > ep_out->bulk.length)
                                {
                                    count = ep_out->bulk.length;
                                }

                                if (count)
                                {
                                    pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control) + (sequence ? 0 : ep_out->size);
                                    
                                    stm32wb_usbd_dcd_pma_read(pma_address, ep_out->bulk.data, count);

                                    ep_out->bulk.data += count;
                                    ep_out->bulk.count += count;
                                }

                                count = ep_out->bulk.count;
                                
                                ep_out_callback = ep_out->bulk.callback;
                                ep_out_context = ep_out->bulk.context;
                                
                                ep_out->bulk.callback = NULL;
                                
                                // armv7m_rtt_printf("DCD_EP_OUT_CALLBACK(ep_addr=%02x, count=%d)\n", (ep_index | 0x00), ep_out->bulk.count);
                                
                                if (ep_out_callback)
                                {
                                    (*ep_out_callback)(ep_out_context, (ep_index | 0x00), count);
                                }
                            }
                        }
                        else
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
                        {
                            if (count > ep_out->bulk.length)
                            {
                                count = ep_out->bulk.length;
                            }
                            
                            if (count)
                            {
                                pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_out->control);

                                stm32wb_usbd_dcd_pma_read(pma_address, ep_out->bulk.data, count);
                                
                                ep_out->bulk.data += count;
                                ep_out->bulk.count += count;
                                ep_out->bulk.length -= count;
                            }
                            
                            if ((count == ep_out->size) && ep_out->bulk.length)
                            {
                                USB_EP_STAT_RX(ep_index, USB_EP_RX_VALID);
                            }
                            else
                            {
                                ep_out_callback = ep_out->bulk.callback;
                                ep_out_context = ep_out->bulk.context;
                                
                                ep_out->bulk.callback = NULL;
                                
                                // armv7m_rtt_printf("DCD_EP_OUT_CALLBACK(ep_addr=%02x, count=%d)\n", (ep_index | 0x00), ep_out->bulk.count);
                                
                                if (ep_out_callback)
                                {
                                    (*ep_out_callback)(ep_out_context, (ep_index | 0x00), count);
                                }
                            }
                        }
		    }
		}

		if (usb_ep & USB_EP_CTR_TX)
		{
                    USB_EP_CTR_TX_RESET(ep_index);

		    ep_in = &stm32wb_usbd_dcd_device.ep_in[ep_index -1];

#if (STM32WB_USBD_DCD_ISO_SUPPORTED == 1)
		    if ((ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_MASK) == STM32WB_USBD_DCD_EP_CONTROL_TYPE_ISO)
		    {
			/* ISO */

                        (*stm32wb_usbd_dcd_device.iso_in_routine)(ep_index, ep_in);
		    }
		    else
#endif /* (STM32WB_USBD_DCD_ISO_SUPPORTED == 1) */
		    {
                        if (ep_in->bulk.length)
                        {
#if (STM32WB_USBD_DCD_DBL_SUPPORTED == 1)
                            if (ep_in->control & STM32WB_USBD_DCD_EP_CONTROL_TYPE_DBL)
                            {
                                if (ep_in->bulk.count)
                                {
                                    count = ep_in->bulk.count;

                                    sequence = (usb_ep & USB_EP_DTOG_TX) ? 1 : 0;
                                    
                                    pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control) + (sequence ? ep_in->size : 0);
                                
                                    USB_PMA_TX_ADDRESS(ep_index, pma_address);
                                    USB_PMA_TX_COUNT(ep_index, count);
                                    
                                    USB_EP_STAT_TX(ep_index, USB_EP_TX_VALID);

                                    ep_in->bulk.data += count;
                                    ep_in->bulk.length -= count;
                                    
                                    if (ep_in->bulk.length)
                                    {
                                        count = ep_in->bulk.length;
                                        
                                        if (count > ep_in->size)
                                        {
                                            count = ep_in->size;
                                        }
                                        
                                        pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control) + (sequence ? 0 : ep_in->size);

                                        stm32wb_usbd_dcd_pma_write(pma_address, ep_in->bulk.data, count);

                                        ep_in->bulk.count = count;
                                    }
                                    else
                                    {
                                        ep_in->bulk.count = 0;
                                    }
                                }
                            }
                            else
#endif /* STM32WB_USBD_DCD_DBL_SUPPORTED == 1 */
                            {
                                count = ep_in->bulk.length;
				
                                if (count > ep_in->size)
                                {
                                    count = ep_in->size;
                                }
                                
