GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_dcd.c
                                pma_address = STM32WB_USBD_DCD_EP_CONTROL_PMA_ADDRESS(ep_in->control);

                                stm32wb_usbd_dcd_pma_write(pma_address, ep_in->bulk.data, count);
                                
                                USB_PMA_TX_COUNT(ep_index, count);
                                
                                USB_EP_STAT_TX(ep_index, USB_EP_TX_VALID);
                                
                                ep_in->bulk.data += count;
                                ep_in->bulk.length -= count;
                            }
                        }
                        else
                        {
                            ep_in_callback = ep_in->bulk.callback;
                            ep_in_context = ep_in->bulk.context;
                                
                            ep_in->bulk.callback = NULL;
                            
                            // armv7m_rtt_printf("DCD_EP_IN_CALLBACK(ep_addr=%02x)\n", (ep_index | 0x80));
                            
                            if (ep_in_callback)
                            {
                                (*ep_in_callback)(ep_in_context, (ep_index | 0x80));
                            }
                        }
		    }
		}
	    }
	    
	    usb_istr = USB->ISTR;
	}
	while (usb_istr & USB_ISTR_CTR);
    }

#if (STM32WB_USBD_DCD_SOF_SUPPORTED == 1)
    if (usb_istr & USB_ISTR_SOF)
    {
        if (USB->CNTR & USB_CNTR_SOFM)
        {
            if (stm32wb_usbd_dcd_device.sof_callback)
            {
                (*stm32wb_usbd_dcd_device.sof_callback)(stm32wb_usbd_dcd_device.sof_context, (USB->FNR & USB_FNR_FN));
            }
        }
        
        USB->ISTR = (uint16_t)~USB_ISTR_SOF;
    }
#endif /* STM32WB_USBD_DCD_SOF_SUPPORTED == 1 */

    if (usb_istr & (USB_ISTR_WKUP | USB_ISTR_SUSP | USB_ISTR_RESET | USB_ISTR_L1REQ))
    {
	if (usb_istr & USB_ISTR_WKUP)
	{
            if (stm32wb_usbd_dcd_device.lpm_state != STM32WB_USBD_DCD_LPM_STATE_L3)
            {
                lpm_state = armv7m_atomic_swapb(&stm32wb_usbd_dcd_device.lpm_state, STM32WB_USBD_DCD_LPM_STATE_L0);
                
                if (lpm_state != STM32WB_USBD_DCD_LPM_STATE_L0)
                {
                    armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_LPMODE);

                    // armv7m_rtt_printf("DCD_LOCK\n");

                    stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP);
                    
                    events |= STM32WB_USBD_DCD_EVENT_RESUME;
                }
            }
            
            USB->ISTR = (uint16_t)~USB_ISTR_WKUP;
	}
	
	if (usb_istr & (USB_ISTR_SUSP | USB_ISTR_L1REQ))
	{
            if (stm32wb_usbd_dcd_device.lpm_state != STM32WB_USBD_DCD_LPM_STATE_L3)
            {
                armv7m_atomic_orh(&USB->CNTR, USB_CNTR_FSUSP);

#if (STM32WB_USBD_DCD_SOF_SUPPORTED == 1)
                armv7m_atomic_andh(&USB->CNTR, ~USB_CNTR_SOFM);
#endif /* STM32WB_USBD_DCD_SOF_SUPPORTED == 1 */
            
                armv7m_atomic_orh(&USB->CNTR, USB_CNTR_LPMODE);

                stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP);
    
                // armv7m_rtt_printf("DCD_UNLOCK\n");
                
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
                if (usb_istr & USB_ISTR_L1REQ)
                {
                    // armv7m_rtt_printf("DCD_LPM_BSEL=%d\n", ((USB->LPMCSR & USB_LPMCSR_BESL) >> 4));
                    stm32wb_usbd_dcd_device.lpm_state = STM32WB_USBD_DCD_LPM_STATE_L1;
              
                    events |= STM32WB_USBD_DCD_EVENT_SLEEP;                
                }
                else
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
                {
                    stm32wb_usbd_dcd_device.lpm_state = STM32WB_USBD_DCD_LPM_STATE_L2;
              
                    events |= STM32WB_USBD_DCD_EVENT_SUSPEND;                
                }
            }
            
            USB->ISTR = (uint16_t)~(USB_ISTR_SUSP | USB_ISTR_L1REQ);
	}
        
	if (usb_istr & USB_ISTR_RESET)
	{
            USB->CNTR = USB_CNTR_FRES;
	    USB->ISTR = (uint16_t)~USB_ISTR_RESET;
            USB->DADDR = 0;

            lpm_state = armv7m_atomic_swapb(&stm32wb_usbd_dcd_device.lpm_state, STM32WB_USBD_DCD_LPM_STATE_L0);
            
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
            if ((lpm_state == STM32WB_USBD_DCD_LPM_STATE_L1) || (lpm_state == STM32WB_USBD_DCD_LPM_STATE_L2))
#else /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
            if (lpm_state == STM32WB_USBD_DCD_LPM_STATE_L2)
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */
            {
                // armv7m_rtt_printf("DCD_LOCK\n");

                stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP);
            }

#if (STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1)
            stm32wb_lptim_timeout_stop(&stm32wb_usbd_dcd_device.timeout);
#endif /* STM32WB_USBD_DCD_REMOTE_WAKEUP_SUPPORTED == 1 */

	    events |= STM32WB_USBD_DCD_EVENT_RESET;
	}
    }
    
    if (events)
    {
        armv7m_atomic_or(&stm32wb_usbd_dcd_device.events, events);
        
        armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_DCD);
    }
    
    // // armv7m_rtt_printf("DCD_ISR_LEAVE(cntr=%04x, istr=%04x, lpm_state=%d, events=%08x)\n", USB->CNTR, USB->ISTR, stm32wb_usbd_dcd_device.lpm_state, events);
}

void USB_LP_IRQHandler(void)
{
    stm32wb_usbd_dcd_interrupt();
    
    __DSB();
}

void USB_HP_IRQHandler(void)
{
    stm32wb_usbd_dcd_interrupt();

    __DSB();
}

void CRS_IRQHandler(void)
{
    // // armv7m_rtt_printf("CRS_CLK48_SYNC(%d)\n", (uint32_t)armv7m_systick_micros());

    CRS->ICR = CRS_ICR_SYNCOKC;

    stm32wb_usbd_dcd_device.clk48_sync = true;
    
    armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_DCD);
    
    __DSB();
}

void USBD_DCD_HSEMHandler(void)
{
    armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_USBD_DCD);
}

void USBD_DCD_SWIHandler(void)
{
    stm32wb_usbd_dcd_event();
}
